app/Controllers/Dosen.php

SELECT *
FROM `dosen`
 LIMIT 100
SELECT COUNT(*) AS `numrows`
FROM `dosen`
---
public function index()
{

 $DataDosen = new DosenModel();
 $pager = \config\Services::pager();

 $data = array(
    'DataDosen' => $DataDosen->paginate(100,'dosen'),
    'pager' => $DataDosen->pager
    );