app/Controllers/login.php

    public function process()
    {
        $users = new UsersModel();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $dataUser = $users->where([
            'username' => $username,
        ])->first();
---
SELECT *
FROM `users`
WHERE `username` = 'mirna'
 LIMIT 1