app/Controllers/register.php

INSERT INTO `users` (`username`, `password`, `name`, `created_at`, `updated_at`) VALUES ('mirna', '$2y$10$GgFXrybWFqzesNqEUY0x3emHUKrCN8WgwEgptJI2gCQbVk.aFvDAe', 'mirna', '2024-04-20 04:49:12', '2024-04-20 04:49:12')
---
            return redirect()->back()->withInput();
        }
        $users = new UsersModel();
        $users->insert([
            'username' => $this->request->getVar('username'),
            'password' => password_hash($this->request->getVar('password'), PASSWORD_BCRYPT),
            'name' => $this->request->getVar('name')
        ]);