app/Controllers/Transaksi.php

SELECT *
FROM `customer`
---
    public function index()
    {
        $data = [
            'active' => 'transaksi',
            'judul' => 'Transaksi'
        ];
        $data['customers'] = $this->customerModel->findAll();